---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.SupportCheckDone
source: html/85d968c0-7ffe-dd2a-c7fa-cf339597f0e0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.SupportCheckDone Property

Member support check is complete. No unsupported elements detected.

## Syntax (C#)
```csharp
public static FailureDefinitionId SupportCheckDone { get; }
```